In [1]:
import pandas as pd

In [6]:
df_x = pd.read_csv('test.csv')

In [7]:
df_x.head()

,ID,hotel,lead_time,arrival_date_year,arrival_date_month,arrival_date_week_number,arrival_date_day_of_month,stays_in_weekend_nights,stays_in_week_nights,adults,...,reserved_room_type,assigned_room_type,booking_changes,deposit_type,agent,company,days_in_waiting_list,customer_type,required_car_parking_spaces,total_of_special_requests
0,91531,City Hotel,75,2017,April,13,1,2,5,2,...,D,D,0,No Deposit,9.0,NaN,0,Transient,0,1
1,91532,City Hotel,208,2017,April,13,1,4,10,2,...,A,A,0,No Deposit,9.0,NaN,0,Transient,0,1
2,91533,Resort Hotel,12,2017,April,13,1,2,5,2,...,A,A,0,No Deposit,40.0,NaN,0,Contract,0,1
3,91534,City Hotel,76,2017,April,13,1,2,5,3,...,D,D,0,No Deposit,9.0,NaN,0,Transient,0,0
4,91535,City Hotel,9,2017,April,13,1,2,4,2,...,F,F,0,No Deposit,9.0,NaN,0,Transient,0,0

In [8]:
df_x.columns.tolist()

['ID',
 'hotel',
 'lead_time',
 'arrival_date_year',
 'arrival_date_month',
 'arrival_date_week_number',
 'arrival_date_day_of_month',
 'stays_in_weekend_nights',
 'stays_in_week_nights',
 'adults',
 'children',
 'babies',
 'meal',
 'country',
 'market_segment',
 'distribution_channel',
 'is_repeated_guest',
 'previous_cancellations',
 'previous_bookings_not_canceled',
 'reserved_room_type',
 'assigned_room_type',
 'booking_changes',
 'deposit_type',
 'agent',
 'company',
 'days_in_waiting_list',
 'customer_type',
 'required_car_parking_spaces',
 'total_of_special_requests']

In [9]:
df_x.shape

(27859, 29)

In [10]:
df_x['arrival_date'] = df_x['arrival_date_year'].astype(str) + '-' + pd.to_datetime(df_x['arrival_date_month'], format='%B').dt.month.astype(str).apply(lambda x: x.zfill(2)) + '-' + df_x['arrival_date_day_of_month'].astype(str).apply(lambda x: x.zfill(2))

In [11]:
df_x['arrival_date']

0        2017-04-01
1        2017-04-01
2        2017-04-01
3        2017-04-01
4        2017-04-01
            ...
27854    2017-08-31
27855    2017-08-31
27856    2017-08-31
27857    2017-08-31
27858    2017-08-31
Name: arrival_date, Length: 27859, dtype: object

In [12]:
df_y = pd.read_csv('train_label.csv')

In [13]:
df_y

    arrival_date  label
0     2015-07-01    2.0
1     2015-07-02    1.0
2     2015-07-03    1.0
3     2015-07-04    1.0
4     2015-07-05    1.0
..           ...    ...
635   2017-03-27    2.0
636   2017-03-28    1.0
637   2017-03-29    2.0
638   2017-03-30    3.0
639   2017-03-31    3.0

[640 rows x 2 columns]

In [14]:
df_new_x = df_x.groupby('arrival_date')['ID'].count()

In [15]:
df_new_x = df_new_x.to_frame()

In [16]:
df_x['stay_nights'] = df_x['stays_in_weekend_nights']+df_x['stays_in_week_nights']

In [17]:
df_new_x['stay_nights_sum'] = df_x.groupby('arrival_date')['stay_nights'].sum()

In [18]:
df_new_x['stays_in_weekend_nights_sum'] = df_x.groupby('arrival_date')['stays_in_weekend_nights'].sum()

In [19]:
df_new_x['stays_in_week_nights_sum'] = df_x.groupby('arrival_date')['stays_in_week_nights'].sum()

In [20]:
df_new_x.head(10)

,ID,stay_nights_sum,stays_in_weekend_nights_sum,stays_in_week_nights_sum
arrival_date,,,,
2017-04-01,132,524,225,299
2017-04-02,96,367,186,181
2017-04-03,231,764,251,513
2017-04-04,125,381,26,355
2017-04-05,252,878,54,824
2017-04-06,229,711,60,651
2017-04-07,128,374,92,282
2017-04-08,200,901,343,558
2017-04-09,273,1092,549,543
2017-04-10,180,613,185,428

In [19]:
df_new_x[df_new_x.index=='2015-09-25']

,ID,stay_nights_sum,stays_in_weekend_nights_sum,stays_in_week_nights_sum
arrival_date,,,,
2015-09-25,275,1152,436,716

In [23]:
from joblib import dump, load
clf = load('clf.joblib')

In [25]:
clf.predict(df_new_x)

array([2., 1., 3., 2., 2., 2., 2., 3., 3., 2., 2., 2., 2., 3., 3., 3., 2.,
       2., 2., 2., 2., 3., 3., 2., 1., 2., 2., 3., 3., 3., 3., 2., 2., 2.,
       3., 3., 3., 3., 2., 2., 2., 2., 3., 3., 3., 2., 2., 2., 2., 3., 3.,
       3., 2., 2., 2., 2., 2., 3., 2., 2., 2., 2., 2., 3., 3., 3., 2., 2.,
       2., 2., 2., 3., 3., 2., 2., 2., 2., 3., 3., 3., 2., 2., 2., 2., 3.,
       3., 3., 2., 2., 2., 2., 3., 3., 3., 2., 2., 2., 2., 2., 3., 3., 2.,
       2., 2., 2., 3., 3., 3., 2., 1., 2., 2., 3., 3., 3., 2., 2., 2., 2.,
       3., 3., 3., 2., 2., 2., 2., 3., 3., 3., 2., 2., 2., 2., 3., 3., 2.,
       2., 2., 2., 2., 3., 3., 2., 1., 2., 2., 2., 3., 2., 3., 2., 1., 2.])

In [26]:
test_label = pd.read_csv('test_nolabel.csv')

In [28]:
test_label['label'] = clf.predict(df_new_x)

In [30]:
test_label.to_csv('baseline_1225.csv', index=False)